БухЭксп/Documents/CW_ВыбытиеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ВыбытиеТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CW_СостоянияТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ТопливоТС</xr:Item>
				<xr:Item>InformationRegister.CW_ПараметрыТС</xr:Item>
				<xr:Item>InformationRegister.CW_ШиныТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШиныТранспортногоСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоУстановкиШины</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_МестаУстановкиШинТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТопливоТранспортногоСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Топливо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_РегистрацонныеЗнакиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_РегистрацонныеЗнакиАвтомобилей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Произвольный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СостоянияТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СостоянияТС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СостоянияТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ПробегТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ПробегТС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПробегПорожний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПробегСГрузом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ФизическиеЛица</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ТопливоТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ТопливоТС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Топливо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ШиныТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ШиныТС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоУстановкиШины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_МестаУстановкиШинТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_ВыбытиеТС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	ВедетсяУчетШинТранспортногоСредства = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетШинТранспортногоСредства");
	Элементы.ГруппаШиныТС.Видимость		= ВедетсяУчетШинТранспортногоСредства;
	
	ОбновитьДанныеРегистрационныхЗнаков();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеРегистрационныхЗнаков()
	
	РегистрационныйЗнак = РегистрыСведений.CW_РегистрацонныеЗнакиАвтомобилей.ПолучитьПредставлениеГосНомераТранспортногоСредства(Объект.Дата, Объект.ТранспортноеСредство);

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьИнформациюОТранспортномСредстве()
	
	ДатаСреза = ?(ЗначениеЗаполнено(Объект.Дата), Новый Граница(Объект.Дата, ВидГраницы.Исключая), ТекущаяДата());
	
	//---
	//Регистрационный знак
	ОбновитьДанныеРегистрационныхЗнаков();

	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза"			, ДатаСреза);
	Запрос.УстановитьПараметр("ТранспортноеСредство", Объект.ТранспортноеСредство);
	
	// ---
	// СОСТОЯНИЕ ТС
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СостоянияТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_СостоянияТССрезПоследних.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.CW_СостоянияТС.СрезПоследних(&ДатаСреза, ТранспортноеСредство = &ТранспортноеСредство) КАК CW_СостоянияТССрезПоследних";
	
	
	РезультатЗапросаСостояние = Запрос.Выполнить();
	ВыборкаСостояние = РезультатЗапросаСостояние.Выбрать();
	Если ВыборкаСостояние.Следующий() Тогда
		ТекущееСостояние = ВыборкаСостояние.Состояние;
	КонецЕсли;
	
	// ---
	// Пробег ТС
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПробегТСОбороты.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	СУММА(CW_ПробегТСОбороты.ПробегОборот) КАК Пробег,
	               |	СУММА(CW_ПробегТСОбороты.ПробегСГрузомОборот) КАК ПробегСГрузом,
	               |	СУММА(CW_ПробегТСОбороты.ПробегПорожнийОборот) КАК ПробегПорожний
	               |ИЗ
	               |	РегистрНакопления.CW_ПробегТС.Обороты(, , Период, ТранспортноеСредство = &ТранспортноеСредство) КАК CW_ПробегТСОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ПробегТСОбороты.ТранспортноеСредство";
	
	РезультатЗапросаПробегТС = Запрос.Выполнить();
	ВыборкаПробегТС = РезультатЗапросаПробегТС.Выбрать();
	Если ВыборкаПробегТС.Следующий() Тогда
		Пробег 			= ВыборкаПробегТС.Пробег;
		ПробегСГрузом 	= ВыборкаПробегТС.ПробегСГрузом;
		ПробегПорожний 	= ВыборкаПробегТС.ПробегПорожний;
	КонецЕсли;
	
	
	_ОбновитьОстаткиТоплива();
	_ОбновитьШинытранспортногоСредства();

КонецПроцедуры

&НаСервере
Процедура _ОбновитьОстаткиТоплива()
	
	// ---
	// ТОПЛИВО ТС
	ДатаСреза = ?(ЗначениеЗаполнено(Объект.Дата), Новый Граница(Объект.Дата, ВидГраницы.Исключая), ТекущаяДата());
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза"			, ДатаСреза);
	Запрос.УстановитьПараметр("ТранспортноеСредство", Объект.ТранспортноеСредство);
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ТопливоТСОстатки.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_ТопливоТСОстатки.Топливо КАК Топливо,
	|	СУММА(CW_ТопливоТСОстатки.КоличествоОстаток) КАК Количество
	|ИЗ
	|	РегистрНакопления.CW_ТопливоТС.Остатки(&ДатаСреза, ТранспортноеСредство = &ТранспортноеСредство) КАК CW_ТопливоТСОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ТопливоТСОстатки.ТранспортноеСредство,
	|	CW_ТопливоТСОстатки.Топливо";
	
	РезультатЗапросаТопливоТС = Запрос.Выполнить();
	
	Объект.ТопливоТранспортногоСредства.Загрузить(РезультатЗапросаТопливоТС.Выгрузить());

КонецПроцедуры

&НаСервере
Процедура _ОбновитьШинытранспортногоСредства()
	
	ВедетсяУчетШинТранспортногоСредства = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетШинТранспортногоСредства");
	
	Если Не ВедетсяУчетШинТранспортногоСредства Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСреза = ?(ЗначениеЗаполнено(Объект.Дата), Новый Граница(Объект.Дата, ВидГраницы.Исключая), ТекущаяДата());
	
	// ---
	// ШИНЫ ТС
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза"			, ДатаСреза);
	Запрос.УстановитьПараметр("ТранспортноеСредство", Объект.ТранспортноеСредство);
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ШиныТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_ШиныТССрезПоследних.МестоУстановкиШины КАК МестоУстановкиШины,
	|	CW_ШиныТССрезПоследних.Шина КАК Шина
	|ИЗ
	|	РегистрСведений.CW_ШиныТС.СрезПоследних(&ДатаСреза, ТранспортноеСредство = &ТранспортноеСредство) КАК CW_ШиныТССрезПоследних";
	
	РезультатЗапросаШины = Запрос.Выполнить();
	
	Объект.ШиныТранспортногоСредства.Загрузить(РезультатЗапросаШины.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ЗаполнитьИнформациюОТранспортномСредстве();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстаткиТоплива(Команда)
	_ОбновитьОстаткиТоплива();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьШинытранспортногоСредства(Команда)
	_ОбновитьШинытранспортногоСредства();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
		
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры



#КонецОбласти
